indexxue/TM4C123GH6PM/Common/inc/gpio_pins.h
/* Auto-generated by gen_config.py — do not edit */
#ifndef GPIO_PINS_H
#define GPIO_PINS_H
#include "driverlib/gpio.h"
#include "inc/hw_memmap.h"

#define GPIO_BT_RX_PORT   GPIO_PORTA_BASE
#define GPIO_BT_RX_PIN    GPIO_PIN_0
#define GPIO_BT_RX_MASK   GPIO_PIN_0

#define GPIO_BT_TX_PORT   GPIO_PORTA_BASE
#define GPIO_BT_TX_PIN    GPIO_PIN_1
#define GPIO_BT_TX_MASK   GPIO_PIN_1

#define GPIO_M1_IN1_PORT   GPIO_PORTA_BASE
#define GPIO_M1_IN1_PIN    GPIO_PIN_2
#define GPIO_M1_IN1_MASK   GPIO_PIN_2

#define GPIO_M1_IN2_PORT   GPIO_PORTA_BASE
#define GPIO_M1_IN2_PIN    GPIO_PIN_3
#define GPIO_M1_IN2_MASK   GPIO_PIN_3

#define GPIO_M2_IN1_PORT   GPIO_PORTA_BASE
#define GPIO_M2_IN1_PIN    GPIO_PIN_4
#define GPIO_M2_IN1_MASK   GPIO_PIN_4

#define GPIO_M2_IN2_PORT   GPIO_PORTA_BASE
#define GPIO_M2_IN2_PIN    GPIO_PIN_5
#define GPIO_M2_IN2_MASK   GPIO_PIN_5

#define GPIO_LINE1_PORT   GPIO_PORTA_BASE
#define GPIO_LINE1_PIN    GPIO_PIN_6
#define GPIO_LINE1_MASK   GPIO_PIN_6

#define GPIO_LINE2_PORT   GPIO_PORTA_BASE
#define GPIO_LINE2_PIN    GPIO_PIN_7
#define GPIO_LINE2_MASK   GPIO_PIN_7

#define GPIO_M3_PWM_PORT   GPIO_PORTB_BASE
#define GPIO_M3_PWM_PIN    GPIO_PIN_0
#define GPIO_M3_PWM_MASK   GPIO_PIN_0

#define GPIO_M4_PWM_PORT   GPIO_PORTB_BASE
#define GPIO_M4_PWM_PIN    GPIO_PIN_1
#define GPIO_M4_PWM_MASK   GPIO_PIN_1

#define GPIO_I2C_SCL_PORT   GPIO_PORTB_BASE
#define GPIO_I2C_SCL_PIN    GPIO_PIN_2
#define GPIO_I2C_SCL_MASK   GPIO_PIN_2

#define GPIO_I2C_SDA_PORT   GPIO_PORTB_BASE
#define GPIO_I2C_SDA_PIN    GPIO_PIN_3
#define GPIO_I2C_SDA_MASK   GPIO_PIN_3

#define GPIO_BTN_UP_PORT   GPIO_PORTB_BASE
#define GPIO_BTN_UP_PIN    GPIO_PIN_4
#define GPIO_BTN_UP_MASK   GPIO_PIN_4

#define GPIO_BTN_OK_PORT   GPIO_PORTB_BASE
#define GPIO_BTN_OK_PIN    GPIO_PIN_5
#define GPIO_BTN_OK_MASK   GPIO_PIN_5

#define GPIO_M1_PWM_PORT   GPIO_PORTB_BASE
#define GPIO_M1_PWM_PIN    GPIO_PIN_6
#define GPIO_M1_PWM_MASK   GPIO_PIN_6

#define GPIO_M2_PWM_PORT   GPIO_PORTB_BASE
#define GPIO_M2_PWM_PIN    GPIO_PIN_7
#define GPIO_M2_PWM_MASK   GPIO_PIN_7

#define GPIO_M4_ENCA_PORT   GPIO_PORTC_BASE
#define GPIO_M4_ENCA_PIN    GPIO_PIN_0
#define GPIO_M4_ENCA_MASK   GPIO_PIN_0

#define GPIO_M4_ENCB_PORT   GPIO_PORTC_BASE
#define GPIO_M4_ENCB_PIN    GPIO_PIN_1
#define GPIO_M4_ENCB_MASK   GPIO_PIN_1

#define GPIO_LINE5_PORT   GPIO_PORTC_BASE
#define GPIO_LINE5_PIN    GPIO_PIN_2
#define GPIO_LINE5_MASK   GPIO_PIN_2

#define GPIO_LINE6_PORT   GPIO_PORTC_BASE
#define GPIO_LINE6_PIN    GPIO_PIN_3
#define GPIO_LINE6_MASK   GPIO_PIN_3

#define GPIO_M3_IN1_PORT   GPIO_PORTC_BASE
#define GPIO_M3_IN1_PIN    GPIO_PIN_4
#define GPIO_M3_IN1_MASK   GPIO_PIN_4

#define GPIO_BTN_DN_PORT   GPIO_PORTC_BASE
#define GPIO_BTN_DN_PIN    GPIO_PIN_5
#define GPIO_BTN_DN_MASK   GPIO_PIN_5

#define GPIO_LINE3_PORT   GPIO_PORTC_BASE
#define GPIO_LINE3_PIN    GPIO_PIN_6
#define GPIO_LINE3_MASK   GPIO_PIN_6

#define GPIO_M3_IN2_PORT   GPIO_PORTC_BASE
#define GPIO_M3_IN2_PIN    GPIO_PIN_7
#define GPIO_M3_IN2_MASK   GPIO_PIN_7

#define GPIO_M4_IN1_PORT   GPIO_PORTD_BASE
#define GPIO_M4_IN1_PIN    GPIO_PIN_0
#define GPIO_M4_IN1_MASK   GPIO_PIN_0

#define GPIO_M4_IN2_PORT   GPIO_PORTD_BASE
#define GPIO_M4_IN2_PIN    GPIO_PIN_1
#define GPIO_M4_IN2_MASK   GPIO_PIN_1

#define GPIO_M1_ENCA_PORT   GPIO_PORTD_BASE
#define GPIO_M1_ENCA_PIN    GPIO_PIN_2
#define GPIO_M1_ENCA_MASK   GPIO_PIN_2

#define GPIO_M1_ENCB_PORT   GPIO_PORTD_BASE
#define GPIO_M1_ENCB_PIN    GPIO_PIN_3
#define GPIO_M1_ENCB_MASK   GPIO_PIN_3

#define GPIO_M2_ENCA_PORT   GPIO_PORTD_BASE
#define GPIO_M2_ENCA_PIN    GPIO_PIN_4
#define GPIO_M2_ENCA_MASK   GPIO_PIN_4

#define GPIO_M2_ENCB_PORT   GPIO_PORTD_BASE
#define GPIO_M2_ENCB_PIN    GPIO_PIN_5
#define GPIO_M2_ENCB_MASK   GPIO_PIN_5

#define GPIO_M3_ENCA_PORT   GPIO_PORTD_BASE
#define GPIO_M3_ENCA_PIN    GPIO_PIN_6
#define GPIO_M3_ENCA_MASK   GPIO_PIN_6

#define GPIO_M3_ENCB_PORT   GPIO_PORTD_BASE
#define GPIO_M3_ENCB_PIN    GPIO_PIN_7
#define GPIO_M3_ENCB_MASK   GPIO_PIN_7

#define GPIO_BAT_ADC_PORT   GPIO_PORTE_BASE
#define GPIO_BAT_ADC_PIN    GPIO_PIN_0
#define GPIO_BAT_ADC_MASK   GPIO_PIN_0

#define GPIO_DBG_TX_PORT   GPIO_PORTE_BASE
#define GPIO_DBG_TX_PIN    GPIO_PIN_1
#define GPIO_DBG_TX_MASK   GPIO_PIN_1

#define GPIO_LINE4_PORT   GPIO_PORTE_BASE
#define GPIO_LINE4_PIN    GPIO_PIN_2
#define GPIO_LINE4_MASK   GPIO_PIN_2

#define GPIO_BUZZER_PORT   GPIO_PORTE_BASE
#define GPIO_BUZZER_PIN    GPIO_PIN_3
#define GPIO_BUZZER_MASK   GPIO_PIN_3

#define GPIO_ULTRA_TRIG_PORT   GPIO_PORTE_BASE
#define GPIO_ULTRA_TRIG_PIN    GPIO_PIN_4
#define GPIO_ULTRA_TRIG_MASK   GPIO_PIN_4

#define GPIO_ULTRA_ECHO_PORT   GPIO_PORTE_BASE
#define GPIO_ULTRA_ECHO_PIN    GPIO_PIN_5
#define GPIO_ULTRA_ECHO_MASK   GPIO_PIN_5

#define GPIO_RGB_LED_PORT   GPIO_PORTF_BASE
#define GPIO_RGB_LED_PIN    GPIO_PIN_4
#define GPIO_RGB_LED_MASK   GPIO_PIN_4

#endif